PacktPublishing/Internet-of-Things-with-ESP32/ch7/optiga_ex/lib/optiga/src/ifx_i2c_physical_layer.c
static void ifx_i2c_pl_guard_time_callback(void *p_ctx)
{
    ifx_i2c_context_t* p_local_ctx = (ifx_i2c_context_t*)p_ctx;
    if (p_local_ctx->pl.register_action == PL_ACTION_READ_REGISTER)
    {
    	if (p_local_ctx->pl.i2c_cmd == PL_I2C_CMD_WRITE)
    	{
    		LOG_PL("[IFX-PL]: GT done-> Start RX\n");
			p_local_ctx->pl.i2c_cmd = PL_I2C_CMD_READ;
			//lint --e{534} suppress "Return value is not required to be checked"
            pal_i2c_read(p_local_ctx->p_pal_i2c_ctx,p_local_ctx->pl.buffer, p_local_ctx->pl.buffer_rx_len);
    	}
    	else if (p_local_ctx->pl.i2c_cmd == PL_I2C_CMD_READ)
    	{
    		LOG_PL("[IFX-PL]: GT done -> REG is read\n");
    		ifx_i2c_pl_frame_event_handler(p_local_ctx,IFX_I2C_STACK_SUCCESS);
    	}
    }
    else if (p_local_ctx->pl.register_action == PL_ACTION_WRITE_REGISTER)
	{
    	LOG_PL("[IFX-PL]: GT done -> REG written\n");
    	ifx_i2c_pl_frame_event_handler(p_local_ctx,IFX_I2C_STACK_SUCCESS);
	}
}

static void ifx_i2c_pl_pal_event_handler(void *p_ctx, host_lib_status_t event)
{   
    ifx_i2c_context_t* p_local_ctx = (ifx_i2c_context_t*)p_ctx;     
    switch (event)
    {
        case PAL_I2C_EVENT_ERROR:            
        case PAL_I2C_EVENT_BUSY:
            // Error event usually occurs when the device is in sleep mode and needs time to wake up
            if (p_local_ctx->pl.retry_counter--)
            {
				LOG_PL("[IFX-PL]: PAL Error -> Continue polling\n");
                pal_os_event_register_callback_oneshot(ifx_i2c_pal_poll_callback,p_local_ctx,PL_POLLING_INVERVAL_US);
            }
            else
            {
                LOG_PL("[IFX-PL]: PAL Error -> Stop\n");
                ifx_i2c_pl_frame_event_handler(p_local_ctx,IFX_I2C_FATAL_ERROR);
            }
            break;
            
        case PAL_I2C_EVENT_SUCCESS:
            LOG_PL("[IFX-PL]: PAL Success -> Wait Guard Time\n");
            pal_os_event_register_callback_oneshot(ifx_i2c_pl_guard_time_callback,p_local_ctx,PL_GUARD_TIME_INTERVAL_US);
            break;
        default:
            break;
    }
}


static void ifx_i2c_pl_soft_reset(ifx_i2c_context_t *p_ctx)
{
    uint8_t i2c_mode_value[2] = {0};
	switch(p_ctx->pl.request_soft_reset)
	{
		case PL_INIT_GET_STATUS_REG:
			p_ctx->pl.request_soft_reset = PL_RESET_WRITE;
			//Read the status register to check if soft reset is supported
			ifx_i2c_pl_read_register(p_ctx, PL_REG_I2C_STATE, PL_REG_LEN_I2C_STATE);
			break;

		case PL_RESET_WRITE:
			//Mask for soft reset bit(5th bit) from the 1st byte of status register
			p_ctx->pl.buffer[0] &= PL_REG_I2C_STATE_SOFT_RESET;	
			if(p_ctx->pl.buffer[0] == PL_REG_I2C_STATE_SOFT_RESET)
			{
				p_ctx->pl.request_soft_reset = PL_RESET_STARTUP;
				//Write 88 register with 0 value
				ifx_i2c_pl_write_register(p_ctx, PL_REG_SOFT_RESET, PL_REG_LEN_SOFT_RESET, i2c_mode_value);
			}
			else
			{
				//Soft reset is not supported by the slave
				p_ctx->pl.frame_state = PL_STATE_UNINIT;
				ifx_i2c_pl_frame_event_handler(p_ctx, IFX_I2C_STACK_ERROR);
			}
			break;
            
		case PL_RESET_STARTUP:
			p_ctx->pl.request_soft_reset= PL_RESET_INIT;
			pal_os_event_register_callback_oneshot((register_callback)ifx_i2c_pl_soft_reset, (void *)p_ctx, STARTUP_TIME_MSEC);
			break;

		case PL_RESET_INIT:
			p_ctx->pl.frame_state = PL_STATE_INIT;
			ifx_i2c_pl_frame_event_handler(p_ctx,IFX_I2C_STACK_SUCCESS);
			break;

        default:
            break;
	}    
}

//lint --e{715} suppress "This is used for synchromous implementation, hence p_ctx not used"
//lint --e{818} suppress "This is ignored as upper layer handler function prototype requires this argument"
static void ifx_i2c_pl_pal_slave_addr_event_handler(void *p_ctx, host_lib_status_t event)
{
    pal_event_status = event;
}

